site/src/main/webapp/org/_posts/2012-05-30-ruby-from-java.org
#+BEGIN_HTML
---
layout: post
title: Ruby From Java
tags: [maven, ruby, jruby, java]
excerpt: Call Ruby code from Java
---
#+END_HTML
* Steps

- Include the jruby-complete-<version>.jar dependency on the classpath
  for your project
- Use BSF, JSR223 or jruby core to "embed" ruby inside java (run ruby
  from java). See the Jruby wiki for more. 
- Try using jruby-complete-<version>.jar to run a ruby script
#+SRC_BEGIN
java -jar jruby-complete-1.6.7.jar -S sass_helper.rb
#+SRC_END
- Package gem into a jar file
#+SRC_BEGIN
mkdir sass-gems
java -jar jruby-complete-1.6.7.jar -S gem install -i ./sass-gems sass --no-rdoc --no-ri
jar cf sass-gems.jar -C sass-gems .
#+SRC_END
- Verify jruby can see gems inside jar file
#+SRC_BEGIN
jar -tf sass-gems.jar | head
java -jar jruby-complete-1.6.7.jar -S sass_helper.rb  # will still fail
java -jar jruby-complete-1.6.7.jar -rsass-gems.jar -S sass_helper.rb
#+SRC_END
- Include jar as maven dependency
#+SRC_BEGIN
mvn deploy:deploy-file -DgroupId=com.upgradingdave -DartifactId=sass-gem -Dversion=3.1.17 -Dpackaging=jar -Dfile=sass-gems.jar -Durl=http://dev.upgradingdave.com/artifactory/ext-release-local -DrepositoryId=upgradingdave-release
#+SRC_END
- Add com.upgradingdave:sass-gems:3.1.17 to pom and then test by
  calling sass_help.rb from RubyExample.java main method
- For convenience, use gem maven plugin to automatically retrieve gems
  as maven artifacts from torquebox rubygems maven proxy repository

* Links
Embedding ruby inside java: 
https://github.com/jruby/jruby/wiki/RedBridge

Package gems into a jar: 
http://blog.nicksieger.com/articles/2009/01/10/jruby-1-1-6-gems-in-a-jar

Maven proxy that automatically converts ruby gems to maven dependencies:
http://rubygems-proxy.torquebox.org/

Gem Maven Plugin
http://blog.mkristian.tk/2010/08/managing-jruby-projects-with-maven.html

Ruby Version Manager (very convenient for installing and using jruby,
along with other ruby implementations)
https://rvm.io/



